Сравнитель/src/Catalogs/ПравилаВыгрузкиТаблиц/ПравилаВыгрузкиТаблиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаВыгрузкиТаблиц</name>
  <owners>Catalog.ТаблицыДанных</owners>
  <attributes>
    <name>База</name>
    <type>
      <types>EnumRef.НомераБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрименяетсяДляОбеихБаз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеханизмВыгрузки</name>
    <type>
      <types>EnumRef.МеханизмыВыгрузкиТаблиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПередВыполнениемЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриВыборкеИзРезультатаЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПослеВыполненияЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриВыгрузкеПроизвольнымАлгоритмом</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

Сравнитель/src/Catalogs/ПравилаВыгрузкиТаблиц/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыгрузитьВОбъектXDTO(Ссылка) Экспорт
	ПравилоXDTO = ОбщегоНазначенияСравнитель.СоздатьОбъектXDTO(1, "ТаблицаДанных.ПравилоВыгрузки");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПравилаВыгрузкиТаблиц.МеханизмВыгрузки КАК МеханизмВыгрузки,
		|	ПравилаВыгрузкиТаблиц.ТекстЗапроса КАК ТекстЗапроса,
		|	ПравилаВыгрузкиТаблиц.ПередВыполнениемЗапроса КАК ПередВыполнениемЗапроса,
		|	ПравилаВыгрузкиТаблиц.ПриВыборкеИзРезультатаЗапроса КАК ПриВыборкеИзРезультатаЗапроса,
		|	ПравилаВыгрузкиТаблиц.ПослеВыполненияЗапроса КАК ПослеВыполненияЗапроса,
		|	ПравилаВыгрузкиТаблиц.ПриВыгрузкеПроизвольнымАлгоритмом КАК ПриВыгрузкеПроизвольнымАлгоритмом
		|ИЗ
		|	Справочник.ПравилаВыгрузкиТаблиц КАК ПравилаВыгрузкиТаблиц
		|ГДЕ
		|	ПравилаВыгрузкиТаблиц.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ПравилоXDTO, Выборка, "ТекстЗапроса, ПередВыполнениемЗапроса, ПриВыборкеИзРезультатаЗапроса
		    |, ПослеВыполненияЗапроса, ПриВыгрузкеПроизвольнымАлгоритмом");
		ПравилоXDTO.МеханизмВыгрузки = ОбщегоНазначения.ИмяЗначенияПеречисления(Выборка.МеханизмВыгрузки);
	КонецЦикла;
	
	ПравилоXDTO.Проверить();
	Возврат ПравилоXDTO;
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
